Revit 2024 API
InsertOrientation Enumeration
 The allowed values for the INSERT_ORIENTATION parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum InsertOrientation
Visual Basic
Public Enumeration InsertOrientation
Visual C++
public enum class InsertOrientation
Members
Member name | Description
Vertical |  Insert is vertical regardless of the wall's slant.
Slanted |  Insert is aligned with the Slanted wall's slant direction.
Exterior |  Insert is aligned with the Tapered wall's exterior face.
Interior |  Insert is aligned with the Tapered wall's interior face.
See Also
Autodesk.Revit.DB Namespace